Config/Reports/ПомощникВводаПлановыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПомощникВводаПлановыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКДПоказателиСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКДПланыСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекПланы</Name>
					<Comment>Используется для настроек СКД "Планы"</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяПлана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиПланаПоступленийВыбытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПланыПоступленийВыбытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКБК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УточнениеПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКБК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФОНов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субсидии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубсидияНов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субсидии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетныйПериод</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетныйПериодНов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеНов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоступленияНов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбытия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбытияНов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Reports/ПомощникВводаПлановыхПоказателей/Forms/СписокПоказателей/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходныеДанные = ПолучитьИзВременногоХранилища(Параметры["АдресХранилища"]);
	
	ЗаполнитьСписокПоказателей(ВходныеДанные);
	
	// Статистика сеанса работы
	ИзмененныеПоказатели_Количество			= ВходныеДанные["ИзмененныеПоказатели_Количество"];
	ИзмененныеПоказатели_КоличествоПоказано	= ВходныеДанные["ИзмененныеПоказатели_КоличествоОтбор"];
	ИзмененныеПоказатели_КоличествоСкрыто	= ИзмененныеПоказатели_Количество - ИзмененныеПоказатели_КоличествоПоказано;
	НовыеПоказатели_Количество				= ВходныеДанные["НовыеПоказатели_Количество"];
	НовыеПоказатели_КоличествоПоказано		= ВходныеДанные["НовыеПоказатели_КоличествоОтбор"];
	НовыеПоказатели_КоличествоСкрыто		= НовыеПоказатели_Количество - НовыеПоказатели_КоличествоПоказано;
	
	КоличествоСкрытых = (ИзмененныеПоказатели_КоличествоСкрыто + НовыеПоказатели_КоличествоСкрыто);
	
	НадписьКоличествоПоказателей = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='новые (%1),  измененные (%2)'"),
		НовыеПоказатели_Количество,
		ИзмененныеПоказатели_Количество);
	
	// Надпись "Есть скрытые отбором"
	НовыйЗаголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Есть скрытые отбором (%1)'"),
		КоличествоСкрытых);
	НастраиваемыйЭлемент = Элементы["СписокПоказателейЕстьСкрытыеОтбором"];
	НастраиваемыйЭлемент.Видимость	= (КоличествоСкрытых > 0);
	НастраиваемыйЭлемент.Заголовок	= НовыйЗаголовок;
	
	// Учтем значения ФО
	Элементы["СписокПоказателейГруппаИФО"].Видимость			= Параметры["ФОУчетПоИФО"];
	Элементы["СписокПоказателейГруппаПодразделение"].Видимость	= Параметры["ФОУчетПоПодразделениям"];
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовкаСообщений = НСтр("ru='Помощник ввода плановых показателей'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокПоказателей

&НаКлиенте
Процедура СписокПоказателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПроверитьИПерейтиКСтрокеЗначенияПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоказателейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоказателейПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЕстьСкрытыеОтбором(Команда)
	
	ТекстСообщения = НСтр("ru='В основной форме помощника установлен отбор.
		|
		|В данной таблице перечислены все модифицированные показатели.
		|Даже те показатели, которые скрыты в основной форме помощника
		|из-за установленного отбора'");
		
	ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейти(Команда)
	
	ПроверитьИПерейтиКСтрокеЗначенияПоказателя();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// 1. Различающиеся значения ИФО
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Различающиеся значения ИФО'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ИФО");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ИФОНов");

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейИФО");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейИФОНов");

	
	//---
	// 2. Различающиеся значения Подразделение
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Различающиеся значения Подразделение'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.Подразделение");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ПодразделениеНов");

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПодразделение");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПодразделениеНов");

	
	//---
	// 3. Различающиеся значения Субсидия
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Различающиеся значения Субсидия'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.Субсидия");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.СубсидияНов");

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейСубсидия");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейСубсидияНов");


	//---
	// 4. Различающиеся значения Отчетный период
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Различающиеся значения Отчетный период'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ОтчетныйПериод");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ОтчетныйПериодНов");

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейОтчетныйПериод");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейОтчетныйПериодНов");


	//---
	// 5. Различающиеся значения Поступления
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Различающиеся значения Поступления'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.Поступления");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ПоступленияНов");

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПоступления");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПоступленияНов");


	//---
	// 6. Различающиеся значения Выбытия
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Различающиеся значения Выбытия'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.Выбытия");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.ВыбытияНов");

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейВыбытия");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейВыбытияНов");


	//---
	// 7. Для добавленного показателя - не выводим прежние значения
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Для добавленного показателя - не выводим прежние значения'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательНовый");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейИФО");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПодразделение");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейСубсидия");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейОтчетныйПериод");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПоступления");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейВыбытия");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПолеНадписьБыло");


	//---
	// 8. Показатели, не отображаемые в основной форме из-за несоответствия отбору
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Показатели, не отображаемые в основной форме из-за несоответствия отбору'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.УдовлетворяетОтбору");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СкрытыйВариантОтчетаЦвет);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейНомерСтроки");


	//---
	// 9. Надпись "было" для измененных показателей
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Надпись ""было"" для измененных показателей'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "было");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПолеНадписьБыло");


	//---
	// 10. Надпись "стало" для измененных показателей
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Надпись ""стало"" для измененных показателей'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательИзменен");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "стало");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПолеНадписьСтало");


	//---
	// 11. Надпись "новый" для новых показателей
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Надпись ""новый"" для новых показателей'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.СписокПоказателей.флагПоказательНовый");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "новый");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокПоказателейПолеНадписьСтало");
	
	Отчеты.ПомощникВводаПлановыхПоказателей.УстановитьУсловноеОформление_ВидКПСБУАУ(ЭтаФорма, "СписокПоказателей", "Отчет.СписокПоказателей");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПоказателей(ВходныеДанные)
	
	ЗапросПоказатели = Новый Запрос();
	ЗапросПоказатели.УстановитьПараметр("ТаблицаИзмененныеПоказатели",	ВходныеДанные["Измененные"].Выгрузить());
	ЗапросПоказатели.УстановитьПараметр("ТаблицаНовыеПоказатели",		ВходныеДанные["Новые"].Выгрузить());
	ЗапросПоказатели.Текст = "
	|/////////////////////////////////////////////////////////////////////////////
	|// [0]. Измененные показатели
	|//
	|ВЫБРАТЬ
	|	// Ядро аналитики
	|	Т.СтатьяПлана			КАК СтатьяПлана,
	|	Т.План					КАК План,
	|	Т.КФО					КАК КФО,
	|	Т.ВидПоказателя			КАК ВидПоказателя,
	|	Т.УточнениеПоказателя	КАК УточнениеПоказателя,
	|
	|	// Значения до изменения
	|	Т.ОтчетныйПериод		КАК ОтчетныйПериод,
	|	Т.ИФО					КАК ИФО,
	|	Т.Подразделение			КАК Подразделение,
	|	Т.Субсидия				КАК Субсидия,
	|	
	|	Т.Поступления			КАК Поступления,
	|	Т.Выбытия				КАК Выбытия,
	|
	|	// Значения после изменения
	|	Т.ОтчетныйПериодНов		КАК ОтчетныйПериодНов,
	|	Т.ИФОНов				КАК ИФОНов,
	|	Т.ПодразделениеНов		КАК ПодразделениеНов,
	|	Т.СубсидияНов			КАК СубсидияНов,
	|	
	|	Т.ПоступленияНов		КАК ПоступленияНов,
	|	Т.ВыбытияНов			КАК ВыбытияНов,
	|	
	|	// Служебные поля
	|	Т.ИдСтроки				КАК ИдСтроки,
	|	Т.УдовлетворяетОтбору	КАК УдовлетворяетОтбору
	|ПОМЕСТИТЬ
	|	ИзмененныеПоказатели
	|ИЗ
	|   &ТаблицаИзмененныеПоказатели	КАК Т
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|// [1]. Новые показатели
	|//
	|ВЫБРАТЬ
	|	// Ядро аналитики
	|	Т.СтатьяПлана			КАК СтатьяПлана,
	|	Т.План					КАК План,
	|	Т.КФО					КАК КФО,
	|	Т.ВидПоказателя			КАК ВидПоказателя,
	|	Т.УточнениеПоказателя	КАК УточнениеПоказателя,
	|	
	|	Т.ОтчетныйПериод		КАК ОтчетныйПериод,
	|	Т.ИФО					КАК ИФО,
	|	Т.Подразделение			КАК Подразделение,
	|	Т.Субсидия				КАК Субсидия,
	|	
	|	Т.Поступления			КАК Поступления,
	|	Т.Выбытия				КАК Выбытия,
	|	
	|	// Служебные поля
	|	Т.ИдСтроки				КАК ИдСтроки,
	|	Т.УдовлетворяетОтбору	КАК УдовлетворяетОтбору
	|ПОМЕСТИТЬ
	|	НовыеПоказатели
	|ИЗ
	|   &ТаблицаНовыеПоказатели	КАК Т
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|// [2]. Все данные в плоском виде
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	// Ядро аналитики
	|	СтатьяПлана				КАК СтатьяПлана,
	|	План					КАК План,
	|	КФО						КАК КФО,
	|	ВидПоказателя			КАК ВидПоказателя,
	|	УточнениеПоказателя		КАК УточнениеПоказателя,
	|	
	|	// Редактируемая часть аналитики
	|	ОтчетныйПериод			КАК ОтчетныйПериод,
	|	ОтчетныйПериодНов		КАК ОтчетныйПериодНов,
	|	ИФО						КАК ИФО,
	|	ИФОНов					КАК ИФОНов,
	|	Подразделение			КАК Подразделение,
	|	ПодразделениеНов		КАК ПодразделениеНов,
	|	Субсидия				КАК Субсидия,
	|	СубсидияНов				КАК СубсидияНов,
	|	
	|	// Значение показателя
	|	Поступления				КАК Поступления,
	|	ПоступленияНов			КАК ПоступленияНов,
	|	Выбытия					КАК Выбытия,
	|	ВыбытияНов				КАК ВыбытияНов,
	|	
	|	// Служебные поля
	|	ИдСтроки				КАК ИдСтроки,
	|	ВЫБОР
	|		КОГДА УдовлетворяетОтбору = ИСТИНА ТОГДА
	|			1
	|		ИНАЧЕ
	|			4
	|	КОНЕЦ					КАК ИндексКартинки,
	|	УдовлетворяетОтбору		КАК УдовлетворяетОтбору,
	|	ИСТИНА					КАК флагПоказательИзменен,
	|	ЛОЖЬ					КАК флагПоказательНовый
	|ИЗ
	|	ИзмененныеПоказатели
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	// Ядро аналитики
	|	СтатьяПлана				КАК СтатьяПлана,
	|	План					КАК План,
	|	КФО						КАК КФО,
	|	ВидПоказателя			КАК ВидПоказателя,
	|	УточнениеПоказателя		КАК УточнениеПоказателя,
	|	
	|	// Редактируемая часть аналитики
	|	НЕОПРЕДЕЛЕНО			КАК ОтчетныйПериод,
	|	ОтчетныйПериод			КАК ОтчетныйПериодНов,
	|	НЕОПРЕДЕЛЕНО			КАК ИФО,
	|	ИФО						КАК ИФОНов,
	|	НЕОПРЕДЕЛЕНО			КАК Подразделение,
	|	Подразделение			КАК ПодразделениеНов,
	|	НЕОПРЕДЕЛЕНО			КАК Субсидия,
	|	Субсидия				КАК СубсидияНов,
	|	
	|	// Значение показателя
	|	0						КАК Поступления,
	|	Поступления				КАК ПоступленияНов,
	|	0						КАК Выбытия,
	|	Выбытия					КАК ВыбытияНов,
	|
	|	// Служебные поля
	|	ИдСтроки				КАК ИдСтроки,
	|	ВЫБОР
	|		КОГДА УдовлетворяетОтбору = ИСТИНА ТОГДА
	|			2
	|		ИНАЧЕ
	|			5
	|	КОНЕЦ					КАК ИндексКартинки,
	|	УдовлетворяетОтбору		КАК УдовлетворяетОтбору,
	|	ЛОЖЬ					КАК флагПоказательИзменен,
	|	ИСТИНА					КАК флагПоказательНовый
	|ИЗ
	|	НовыеПоказатели
	|
	|УПОРЯДОЧИТЬ ПО
	|	флагПоказательНовый
	|;";
	
	Отчет["СписокПоказателей"].Загрузить(ЗапросПоказатели.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИПерейтиКСтрокеЗначенияПоказателя()
	
	ТекДанные = Элементы["СписокПоказателей"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные["УдовлетворяетОтбору"] Тогда
		ТекстСообщения = НСтр("ru='Перейти к выбранному значению показателя в основной форме помощника?'");
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ТекДанные", ТекДанные);
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИПерейтиКСтрокеЗначенияПоказателя_Ответ", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		
	Иначе
		ТекстСообщения = НСтр("ru='Не получится перейти к выбранному значению показателя,
			|потому что это значение скрыто в основной форме помощника
			|из-за установленого отбора'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИПерейтиКСтрокеЗначенияПоказателя_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ТекДанные = ПараметрыОповещения["ТекДанные"];
		
		ВозвращаемоеЗначение = Новый Структура("
			|флагПоказательИзменен,
			|флагПоказательНовый,
			|ИдСтроки");
			
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, ТекДанные);
		
		ЭтаФорма.Закрыть(ВозвращаемоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

#КонецОбласти
